<?php

namespace Database\Seeders;

use App\Models\Disease;
use App\Models\Plant;
use App\Models\PlantSchedule;
use App\Models\Stage;
use App\Models\Step;
use App\Models\UserPlant;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        \App\Models\User::factory(10)->create();
        // \App\Models\Plant::factory(10)->create();


        //  PLANTS
        $plant = Plant::create();
        $plant->name = "Apple";
        $plant->description = "A nice fuit or whatever";
        $plant->season = "all";
        $plant->save();

        $plant = Plant::create();
        $plant->name = "Tomato";
        $plant->description = "A plant which nobody to this day knows whether it's a fruit or a vegetable";
        $plant->season = "spring";
        $plant->save();

//        //DISEASES




        $disease2 = Disease::create();
        $disease2->name="فيروس تجعد واصفرار أوراق الطماطم";
        $disease2->description="الاسم العلمي TYLCV";
        $disease2->symptoms="عندما يصيب فيروس تجعد واصفرار أوراق الطماطم النباتات في مرحلة الشتلات، فيسبب التقزم الشديد للأوراق الصغيرة والأفرع، مما يؤدى إلى نمو كثيف إلى حد ما للنبات. في النباتات القديمة، فإن العدوى تنتج تفريعا ًمفرطاً، وسماكة للأوراق وتجعد، كما أنها تسبب موتاً للعروق واضحاً على نصل الورقة. في مراحل لاحقة من المرض، فإنها تأخذ الملمس الجلدي و هوامشها الميتة تلتف لأعلى وللداخل. إذا وقعت العدوى قبل مرحلة الإزهار، فتنخفض كمية الثمار بصورة كبيرة، وذلك على الرغم من عدم وجود أعراض ملحوظة على سطحها";
        $disease2->chemical_cure="يمكنك استخدام المبيدات الحشرية مثل عائلة البيرثرويدات عن طريق رشها في خنادق في التربة أو رشها خلال مرحلة نمو البادرات ، والذي يمكن بدوره أن يقلل من عدد الحشرات . و ومع ذلك ، فإن استخدام المبيدات بشكل كبير قد يعزز المقاومة في مستعمرات الذبابة البيضاء . بمجرد الإصابة بالفيروس ، لا توجد علاجات ضد هذه الإصابة . مكافحة أعداد الذباب الأبيض تمكنك من تجنب الإصابة بهذا الفيروس .";
        $disease2->organic_cure="لا يوجد علاج ضد فيروس تجعد واصفرار أوراق الطماطم . مكافحة أعداد الذباب الأبيض تمكنك من تجنب الإصابة بهذا الفيروس .";
        $disease2->recommendations="نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت";
        $disease2->protection="• يجب استخدام أصناف مقاومة للمرض .  \r\n• يمكنك الزراعة في وقت مبكر لتجنب ذروة انتشار الذبابة البيضاء .  \r\n• يمكنك التنويع بزراعة أشوار من النباتات غير المعرضة لأضرار الذبابة البيضاء مثل الكوسة والخيار . • \r\n• استخدام الشباك لتغطية مهد البذور .  \r\n• ويجب عليك أيضاً تجنب زراعة المضيفات البديلة بالقرب من الطماطم .  \r\n• كما يجب تغطية مهد البذور أو الحقل بالنشارة العضوية لكسر دورة حياة الذبابة البيضاء .  \r\n• واستخدام الفخاخ البلاستيكية الصفراء اللاصقة .  \r\n• وكذلك مراقبة الحقل والتقاط النباتات المصابة يدوياً ، والتخلص منها ودفنها .  \r\n• والبحث عن الأعشاب الضارة في الحقل وحوله والتخلص منها .  \r\n• وكذلك حرث بقايا النباتات عميقاً بعد الحصاد أو حرقها .  \r\n• كما يمكنك ممارسة التناوب الزراعي مع محاصيل غير معرضة للإصابة بأضرار الذبابة البيضاء .";
        $disease2->reason="إن فيروس تجعد واصفرار أوراق الطماطم لا ينتقل عبر البذور ولا ينتقل ميكانيكياً. ينتشر هذا المرض من قبل الذباب الأبيض من صنف بيميسيا تاباسي. وتتغذى الذبابة البيضاء على سطح الورقة السفلى لعدد من النباتات، كما أنها تنجذب إلى النباتات الصغيرة. يمكن للعدوى أن تحدث وتتم دورتها الكاملة في حوالي 24 ساعة، ويعتبر الطقس الجاف ودرجات الحرارة المرتفعة ظروفاً مناسبة لانتشار الذبابة والمرض.";
        $disease2->type="فيروسات";
        $disease2->save();


        $disease4 = Disease::create();
        $disease4->name="اللفحة المبكرة";
        $disease4->description="• الاسم العلمي : r\n Alternaria solani •يوجد كذلك في : الفليفلة والفلفل الحار , الباذنجان , البطاطا ";
        $disease4->symptoms="• تظهر أولى أعراض المرض على هيئة بقع داكنة مع نمو متحد المركز وهالات صفراء على الأوراق . • متبوع بجفاف الأوراق وتساقطها . • الثمار قد تبدأ بالتعفن ثم تسقط في نهاية الأمر . تحدث أعراض اللفحة المبكرة على أوراق الشجر القديمة ، والسيقان ، والثمار . تظهر بقع ذات لون رمادي مائل إلى البني على أوراق الشجر ، وتنمو تدريجياً بطريقة مركزية حول مركز واضح- مما يشكل المظهر المميز الذي يشبه \" هدف الرماية \" . تكون هذه البقع محاطة بهالة صفراء زاهية . ومع تقدم المرض ، قد تتحول الأوراق بأكملها إلى اللون الأصفر الناجم عن نقص الكلوروفيل وتتساقط ، مما يؤدي إلى تساقط الأوراق بشكل ملحوظ . وعندما تموت الأوراق وتسقط ، تصبح الثمار أكثر عرضة لحروق الشمس . ويظهر نفس النوع من البقع ذات المركز الواضح على السيقان والفواكه . ويبدأ تعفن الفواكه وقد تتساقط في النهاية .";
        $disease4->chemical_cure="عليك النظر دائماً نحو تطبيق نهج متكامل من التدابير الوقائية والعلاجات البيولوجية إذا كانت متوفرة . هناك العديد من المبيدات الفطرية في السوق لمكافحة اللفحة المبكرة . ويمكن استخدام مبيدات الفطريات القائمة على أو التي تحتوي مزيج من الأزوكسيستروبين ، البيرايكلوستيروبين ، الديفينوكونازول ، البوسيكاليد ، الكلوروثالونيل ، الفيناميدون ، المانيب ، المانكوزيب ، التريفلو إكسيس تيروبين ، والزيرام . كما ويوصى بالتنوع والخلط بين المركبات الكيميائية المختلفة . وتطبيق العلاجات في الوقت المحدد مع مراعاة الظروف الجوية . تحقق بعناية من الوقت المسموح فيه بالرش قبل الحصاد ، بحيث يمكنك الحصاد بأمان بعد تطبيق هذه المنتجات .";
        $disease4->organic_cure=" كما وأن تطبيق المنتجات التي تحتوي على البكتيريا العصوية المسببة لأمراض الفطريات أو مبيدات الفطريات القائمة على النحاس المسجلة كمبيدات عضوية يعالج هذا المرض . ";
        $disease4->recommendations="نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت . ";
        $disease4->protection="• يجب عليك استخدام بذور معتمدة أو خالية من مسببات الأمراض .\r\n• والبحث عن الأصناف المقاومة للمرض . \r\n• يجب زراعة البذور أو الشتلات على مهاد مرتفع ومحروث لتحسين الصرف . \r\n• وتأكد من توجيه الصفوف في اتجاه الرياح الرئيسية وتجنب المناطق المظللة . \r\n• وحافظ على مساحة مناسبة بين النباتات للسماح للمظلة الخضرية أن تجف بسرعة بعد هطول الأمطار أو الري . \r\n• كما يجب وضع المهاد على التربة لمنع النباتات من لمس التربة . \r\n• وكذلك مراقبة الحقول بحثا عن علامات المرض ، خاصة أثناء الطقس الرطب . \r\n• وإزالة الأوراق السفلية القريبة جدا من التربة . \r\n• وإزالة الأوراق التي تمت ملاحظة الأعراض عليها وتدميرها . \r\n• وكذلك الحفاظ على النباتات قوية ومخضرة بإضافة ما يكفي من المغذيات . \r\n• وكذلك استخدام العصي الخشبية للحفاظ على النباتات منتصبة ومستقيمة . \r\n• استخدام نظام الري بالتنقيط للحد من بلل الأوراق . \r\n• وقم بالري في الصباح حتى تحافظ على النباتات جافة خلال النهار . \r\n• وقم أيضاً بمكافحة الحشائش القابلة للإصابة في الحقل ومن حوله . \r\n• وتجنب العمل في الحقول عندما تكون النباتات رطبة .";
        $disease4->reason="تنجم الأعراض عن فطر ألترناريا سولاني ، وهي فطريات تعيش على بقايا المحاصيل المصابة في التربة أو على العوائل البديلة . كما قد تكون البذور المشتراة أو الشتلات ملوثة بالفعل . وغالبا ما تصاب الأوراق السفلي عند ملامستها للتربة الملوثة . وتعد درجات الحرارة الدافئة ( 24-29 درجة مئوية ) والرطوبة العالية ( 90 % ) ظروفاً مواتية لتطور المرض . ولذلك تعمل الفترات الرطبة الطويلة ( أو الطقس الرطب / الجاف بالتناوب ) على تحسين إنتاج الأبواغ الفطرية ، والتي قد تنتشر عن طريق الرياح أو تناثر قطرات المطر أو الري العلوي . تكون الثمار التي يتم حصادها ولونها أخضر أو في الظروف الرطبة معرضة بشكل خاص للعدوى . وغالباً ما ينتشر المرض بشدة بعد فترة من الأمطار الغزيرة ، ويعد من الأمراض المدمرة خصوصاً في المناطق الاستوائية وشبه الاستوائية .";
        $disease4->type="الفطريات";
        $disease4->save();

        $disease3 = Disease::create();
        $disease3->name="المن";
        $disease3->description="• الاسم العلمي : Aphis  ي \r\n• يوجد كذلك في : التفاح , الإجاص , العنب , الفاصولياء , الفليفلة والفلفل الحار , الباذنجان , الكرز , المشمش , الخوخ , البسلة , الخيار , اليقطين , الكوسة , الكرنب , البطاطا , اللوبيا الخضراء والسوداء , البسلة الهندية والبسلة الحمراء , البازيلاء والحمص , القطن , قمح , فول الصويا , البصل , الثوم , الأرز , الدخن , اللوز , الذرة الرفيعة , الذرة , الفراولة , الكشمش , الزيتون , الموز , البطاطا الحلوة , البامية , الحمضيات ( الموالح ) , الفول السوداني , المانجو , البابايا , البفرة , قصب السكر , الشعير , القهوة , البطيخ , الرمان , کانولا , عدس , القرنبيط , نباتات الزينة , الكركم , الزنجبيل , الكريلا ( القثاء المر ) , التبغ .";
        $disease3->symptoms=". يتميز النبات بتجعد الأوراق والأفرع . \r\n• ذبول واصفرار الأوراق والأفرع \r\n• توقف النمو \r\n \r\n الأعداد المنخفضة والمتوسطة ليس لها تأثير ضار على النبات . الإصابات البالغة قد تسبب التفاف الأوراق والتواء الأفرع ، وأحيانا الاصفرار والذبول والنمو الضعيف . ستلاحظ نقص عام في ازدهار المحصول . ينتج المن الندوة العسلية التي قد تشجع عدوى إضافية من نمو الفطريات الانتهازية ، والتي تظهر من خلال نمو الأعفان على سطح النبات ( العفن الهبابي ) . الندوة العسلية تجتذب النمل . يستطيع المن -حتى الأعداد القليلة منه- نقل الامراض الفيروسية من نبات لآخر . الظروف الأكثر ملائمة لتكاثر المن وانتشاره هي الأجواء الدافئة الجافة . ";
        $disease3->chemical_cure="يجب اتباع إجراءات وقائية متكاملة مع استخدام المكافحة الحيوية إن وجدت . كن حذراً من استعمال المبيدات الحشرية الكيميائية لأنها قد تسبب مقاومة حشرة المن للمبيدات التي استخدمتها . خطط لاستخدام الفلونيكاميد والماء على الجذع بنسبة 1:20 عند أيام 30 ، 45 ، 60 بعد البذر . يمكنك أيضاً استخدام فبرونيل 2 مل أو الثياميثوكزام 0.2 جرام أو فلونيكاميد 0.3 جرام أو أسيتاميبريد 0.2 جرام ( لكل لتر من الماء ) .";
        $disease3->organic_cure="في حالة الإصابات المتوسطة ، يمكن استخدام محلول صابون مبيد للحشرات أو المحاليل المحتوية على الزيوت النباتية مثل زيت الجرود ( 3 ملالتر ) . يمكن أيضاً للعديد من الفطريات أن تصيب المن وتقتلها إذا توافرت الظروف الرطبة المناسبة . رش المياه على النباتات المصابة قد يحقق نتائج جيدة أيضاً ويزيل مستعمرات المن .";
        $disease3->recommendations="نوصي بتطبيق المكافحة العضوية في المراحل الأولى من المرض أو عندما يقترب المحصول من الحصاد . في المراحل الأكثر تقدما من المرض ، يرجى استخدام المكافحة الكيميائية . لا يوصى بخلط أو استخدام منتجات مختلفة في نفس الوقت . ";
        $disease3->protection="• إبقاء أعداد متنوعة من الأجناس النباتية المختلفة حول الحقول . • التخلص من بقايا المحصول السابق . • يمكن استخدام الأغطية البلاستيكة العاكسة على التربة لإبعاد المن عن الحقل . \r\n• راقب الحقل بانتظام للاكتشاف المبكر لأي أعراض أو آفات وتحديد درجة الخطورة . \r\n• قم بقطف اليرقات يدوياً من النبات أو تخلص من الأجزاء المصابة في النبات . \r\n• يجب تفحص الحشائش حول الحقول لاحتمال تواجد مستعمرات المن بها . يجب تجنب الري الزائد والتسميد المفرط . \r\n• مكافحة النمل قد يحقق نتائج جيدة في القضاء على المن ، لأن النمل يحمى المن وينقله من مكان لآخر . \r\n• قلم فروع أشجارك أو تخلص من الأوراق السفلية على نباتاتك لتحسين تهوية النبات .\r\n• إذا استلزم الامر ، يمكن استخدام الشبكات الواقية لإبعاد المن . \r\n• تحكم في استخدام المبيدات الحشرية لكي لا تؤثر على الحشرات النافعة . \r\n• يجب إزالة الأوراق والأفرع والنباتات التي تظهر عليها إصابات كبيرة بالمن والتخلص منها . ";
        $disease3->reason="المن هي حشرات صغيرة ذات أجساد طرية وأرجل وقرون استشعار طويلة . أحجامها تتراوح بين 0.5 الى 2 مم ولونها قد يكون أصفر أو بني أو أحمر أو أسود حسب النوع الحشرى . قد تظهر الحشرة بدون أجنحة ( وهي الأشكال الأكثر انتشارا ) أو تظهر الافراد المجنحة ذات المظهر الشمعي أو المشعر . غالباً ما تبقى مستعمرات المن كبيرة تتغذى كمجموعات كبيرة على الأسطح السفلية للأفرع الصغيرة أو أطراف الأفرع . تستخدم تلك الحشرات أجزاء الفم الثاقبة الماصة الطويلة أجل امتصاص العصارة من الأنسجة اللينة للنبات . الأعداد القليلة أو المتوسطة لن تحدث ضرراً للنبات . بعد الإصابات الأولية في أواخر الربيع أو بداية الصيف ، تبدأ الأعداد في الانخفاض بصورة طبيعية حتی الاختفاء بسبب الأعداء الطبيعين . العديد من أنواع المن تحمل الفيروسات التي تسبب الأمراض للنباتات .";
        $disease3->type="الحشرات";
        $disease3->save();



//        $disease3 = Disease::create();
//        $disease3->name="المن";
//        $disease3->description="";
//        $disease3->symptoms="";
//        $disease3->chemical_cure="";
//        $disease3->organic_cure="";
//        $disease3->recommendations="خفيفًا.";
//        $disease3->protection=" ";
//        $disease3->reason=" ";
//        $disease3->type="الحشرات";
//        $disease3->save();















        $stage1= Stage::create([
            'name'=>"مرحلة ماقبل الشتلات",
            'plant_id'=>1,
            'interval'=>"4",
            'step'=>1,
        ]);


        $stage2= Stage::create([
            'name'=>"مرحلة الشتلات",
            'plant_id'=>1,
            'interval'=>"2",
            'step'=>2,
        ]);


        $stage3= Stage::create([
            'name'=>"مرحلة النمو",
            'plant_id'=>1,
            'interval'=>"7",
            'step'=>3,
        ]);


        $stage4= Stage::create([
            'name'=>"مرحلة الازهار",
            'plant_id'=>1,
            'interval'=>"2",
            'step'=>4,
        ]);
        $stage5= Stage::create([
            'name'=>"مرحلة الاثمار",
            'plant_id'=>1,
            'interval'=>"2",
            'step'=>5,
        ]);
        $stage6= Stage::create([
            'name'=>"مرحلة الحصاد",
            'plant_id'=>1,
            'interval'=>"4",
            'step'=>6,
        ]);

        $stage7= Stage::create([
            'name'=>"مرحلة مابعد الحصاد",
            'plant_id'=>1,
            'interval'=>"2",
            'step'=>7,
        ]);



        $plantSchedule1 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"اختيار النبات"
        ]);

        $plantSchedule2 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"الزراعة"
        ]);
        $plantSchedule3 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"العناية بالنبات"
        ]);
        $plantSchedule4 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"المراقبة"
        ]);
        $plantSchedule5 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"اختيار الموقع"
        ]);
        $plantSchedule6 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"تجهيز الحقل"
        ]);

        $plantSchedule7= PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"ازالة الاعشاب الضارة"
        ]);
        $plantSchedule8 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"الري"
        ]);

        $plantSchedule9 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"التسميد العضوي"
        ]);

        $plantSchedule10 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"التسميد الكيميائي"
        ]);
        $plantSchedule11 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"اجراء وقائي"
        ]);
        $plantSchedule12 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"حماية النباتات: كيميائية"
        ]);
        $plantSchedule13 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"حماية النباتات: عضوية"
        ]);
        $plantSchedule14 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"حماية النباتات: عضوية"
        ]);
        $plantSchedule15 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"خلال الحصاد"
        ]);
        $plantSchedule16 = PlantSchedule::create([
            'plant_id'=>1,
            'title'=>"بعد الحصاد"
        ]);



        /////////////////////////////stages/////////////
        $step1 = Step::create([
            'plant_schedule_id' => 5,
            'stage_id' => 1,
            'interval' => 1,
            'description' => "توفر التربة الدعم الميكانيكي والمواد المغذية والماء لنمو النبات فيما يلي بعض خصائص التربة المثالية لنمو الخضروات :يتكيف نمو نباتات الطماطم مع التربة الطينية جيدة التصريف، مع درجة الحموضة الحمضية قليلاً بين 6 و 6.8. يجب أن تبقى مناطق الجذور رطبة، لكن ليست رطبة جداً. قد تنمو جذور الطماطم على عمق 3 أمتار في أفضل الظروف، لذلك فإنه من المهم أن تكون التربة رخوة ويمكن للمياه أن تجري بحرية. قد تؤدي الأحواض الصلبة والتربة الطينية الثقيلة إلى تقييد النمو في منطقة الجذر وتسبب نمو النباتات غير الصحية التي تؤدي إلى إعاقة النمو وانخفاض الانتاجية." ,
            'title' => "التربة والظروف الجوية المثالية لمحصول الخضار في حقلك",
        ]);

        $step2 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 1,
            'interval' => 2,
            'description' => "فيما يلي تفاصيل مرات التخصيب هذه وتوقيتاتها:\r\n* تطبيق 8-10 طن لكل فدان من السماد الحيواني أثناء إعداد الحقل.\r\n* تطبيق 42 كجم لكل فدان من اليوريا، و 52 كجم لكل فدان من الديامونيوم فوسفات DAP و 33 كجم لكل فدان من موريات البوتاس MOP قبل 2 أو 3 أيام من الزراعة.\r\n* ضع 20 كجم لكل فدان من اليوريا بعد 25-35 يومًا من الزرع أثناء مرحلة تكوين الزهور. وهذا هو التطبيق الانقسامي الأول.\r\n* ضع 20 كجم لكل فدان من اليوريا بعد 35-45 يوماً من الزرع، خلال مرحلة نمو مجموعات الثمار. وهذا هو التطبيق الانقسامي الثاني.\r\nخلال تطبيق الجزء الثاني من التطبيق الانقسامي، يمكنك إضافة المغذيات الدقيقة:\r\n* الرش الورقي الذي يحتوي على البورون، على سبيل المثال باستخدام البوراكس (4 جم/ لتر). \r\n* في التربة التي تعاني من نقص الزنك، رش كبريتات الزنك على سبيل المثال بواقع 5 جم/ لتر).\r\n* اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك." ,
            'title' => "التسميد المتوازن لمحصول الطماطم",
        ]);

        $step3 = Step::create([
            'plant_schedule_id' => 1,
            'stage_id' => 1,
            'interval' => 2,
            'description' => "" ,
            'title' => "early and late varieties",
        ]);

        $step4 = Step::create([
            'plant_schedule_id' => 6,
            'stage_id' => 1,
            'interval' => 2,
            'description' => "يقلل الحرث الكافي من حجم حبيبات التربة ويفكك التكتلات الصلبة مما يزيد من فرص ملامسة التربة للبذور وتطوير الجذر بشكل افضل احرث الارض مع تقبيب التربة ثم افرم التربه 3-5 مرات للحصول على تربة مفككه " ,
            'title' => "حراثة التربة واعداد الأخاديد لتحسين التربة",
        ]);

        $step5 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 1,
            'interval' => 3,
            'description' => "يضيف السماد الحيواني المواد العضوية إلى التربة، مما يساعد على الاحتفاظ بالمياه والمواد الغذائية. تعتمد كمية الأسمدة المعدنية إلى حد كبير على عوامل مثل نوع المحصول؛ طبيعي أو هجين، والوصول إلى الري، ونوع التربة. إليك بعض التوصيات: \r\n* أضف السماد الحيواني (8-10 طن لكل فدان) إلى التربة خلال عملية الحراثة والتسوية الأخيرة. \r\n* من حيث النسب، يتم إضافة نصف الكمية الإجمالية من النيتروجين N و البوتاسيوم K والكمية الكاملة من الفوسفور P. \r\n* وهذا يصل عملياً إلى 42 كجم لكل فدان من اليوريا، و 52 كجم لكل فدان من الديامونيوم فوسفات DAP، و 33 كجم لكل هكتار من موريات البوتاس MOP.\r\n* اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك." ,
            'title' => "تطبيق التسميد القاعدي اثناء اعداد الحقل",
        ]);
        $step6 = Step::create([
            'plant_schedule_id' => 6,
            'stage_id' => 1,
            'interval' => 3,
            'description' => " تأكد من خلط هذة المنتجات جيدا مع التربة مع اذافة السماد العضوي أثناء تحضير الحقل \r\n.الترايكوديرما فيردي wp %1.5 بواقع 2كجم لكل فدان \r\n.يتم استخدام كعكه النيم بمعدل 1كجم لكل 2-3 متر مربع" ,
            'title' => "عالج التربة اذا لزم الأمر لنمو محاصيل صحية",
        ]);

        $step7 = Step::create([
            'plant_schedule_id' => 9,
            'stage_id' => 1,
            'interval' => 3,
            'description' => "خلال الشهر الأول ، تحتاج الشتلات إلى الكثير من العناصر الغذائية . ولا يعتبر السماد الحيواني مصدرا للمغذيات فحسب ، ولكنه يحتوي أيضا على ثروة من المواد العضوية والمياه ، مما يساعد في الحفاظ على بنية التربة الجيدة للصرف والتهوية . إليك بعض التوصيات : \r\n *يجب إضافة السماد الحيواني أو السماد العضوي المتحلل بالكامل إلى التربة بعد الحراثة الأخيرة وقبل تخطيط الصفوف ( الأخاديد ) . \r\n• الكميات الموصى بها تختلف باختلاف المحصول ، ولكنها عادة ما تكون في حدود 8-10 طن / فدان . تأكد من خلط السماد جيداً بالتربة وإيصاله إلى العمق المناسب . السماد \r\n• اسأل مسئول الإرشاد الزراعي أو تاجر التجزئة المحلي عن الحيواني الذي يناسب أغراضك والكمية المحددة الذي توافق حالتك ." ,
            'title' => "اضافة السماد الحيواني خلال الحرث لدعم النباتات",
        ]);
        $step8 = Step::create([
            'plant_schedule_id' => 13,
            'stage_id' => 1,
            'interval' => 4,
            'description' => "يمكن معالجة البذور قبل 24 ساعة من البذر بمساحيق أو محاليل مضادة للميكروبات أو مبيدات الفطريات ، على سبيل المثال مع الترايكوديرما فيريدي ( 4-10 جم / كجم بذور ) ، أو البكتيريا الزائفة المتألقة ( 10 جم / كجم بذور ) أو الأزوسبيريلوم ( 4 جم / كجم بذور ) . ثم تجفيف البذور المعالجة خلال فترة الليل في مكان محمي ، لثزرع في اليوم التالي . من المهم ضبط العلاج مع الخضروات المعنية حتى يتأثر بقاء البذور وإنباتها . أخيرا ، إذا كانت البذور التي تنوي زراعتها قد تمت معالجتها بأحد هذه المنتجات من قبل ، فليس من الضروري معالجة البذور مرة أخرى . اسأل مسئول الإرشاد الزراعي أو تاجر التجزئة المحلي عن كون أي من الطرق المذكورة يناسب أغراضك ." ,
            'title' => "علاج البذور عن طريق الأساليب البيولوجية قبل البذر",
        ]);

        $step9 = Step::create([
            'plant_schedule_id' => 12,
            'stage_id' => 1,
            'interval' => 4,
            'description' =>"من الجدير بالذكر أن العديد من البذور التي يحصل عليها المزارعون قد تمت معالجتها مسبقاً لتجنب سلسلة من الأمراض . إذا لم يكن الأمر كذلك ، يمكنك معالجة بذور العديد من المحاصيل النباتية أو \" تغليفها \" بالمنتجات الكيميائية التالية لحمايتها من الأمراض والآفات . إليك بعض التوصيات : \r\n • لمكافحة الأمراض الفطرية : يمكن تطبيق المحاليل التي تحتوي على الثيرام أو الكابتان أو المانكوزب ( 2.5 جم / كجم من البذور ) ، وهذا من شأنه أن يوفر الحماية لمدة تصل إلى 3 أسابيع . \r\n • ضد الحشرات الماصة : سيحمي الإماكلوبريد 600 FS بواقع ( 5 مل / كلغ من البذور ) أو الثيوميثوكسام 70 WS بواقع ( 5 جم / كجم من البذور ) البذور لمدة تصل إلى 20 يوما بعد البذر . \r\n • في جميع الحالات ، يجب ترك البذور حتى تجف في الظل لحوالي 30 دقيقة إلى ساعة بعد العلاج . \r\n • اسأل مسؤول الإرشاد الزراعي أو تاجر التجزئة المحلي عن العلاجات الأنسب لأغراضك .",
            'title' => "المعالجات الكيميائية للبذور لتعزيز بقاء الشتلات",
        ]);

        $step10 = Step::create([
            'plant_schedule_id' => 7,
            'stage_id' => 1,
            'interval' => 4,
            'description' =>"هناك طريقة ذكية لتخليص قاع البذر من الحشائش المحتملة ، وهي تحضير التربة كالمعتاد ثم : تأخير البذار حتى ظهور الحشائش الأولى . يمكن بعد ذلك قتل هذه الموجة الأولى من الأعشاب الضارة عن طريق الإثارة السطحية للتربة . يجب أن تكون الإثارة سطحية لتجنب جلب بذور الحشائش المدفونة إلى السطح . لكي تنجح هذه الطريقة ، من المهم أن تكون التربة رطبة ودافئة بدرجة كافية لتشجيع الأعشاب الضارة على الإنبات . بمجرد تنظيف سطح التربة ، يمكن زرع بذور المحاصيل التي تهمك . بعد ذلك ، حافظ على القيعان خالية من الأعشاب حتى الزراعة ، عن طريق إزالة الأعشاب الضارة يدويا .",
            'title' => "اتأكد من الحصول على قيعان بذر خالية من الأعشاب الضارة",
        ]);
        $step11 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 1,
            'interval' => 4,
            'description' =>"إلى جانب إضافة السماد الحيواني إلى تربة البذر ( 2-4 كغم / م 2 من الحاضنات ) لتحسين بنيتها ومحتواها العضوي ، يوصى بتوفير المغذيات للشتلات لمنحها بداية قوية وتقويتها لباقي الموسم . بعد حوالي 7-10 أيام من تقليم الشتلات ، إذا كانت الأوراق تتحول إلى لون أخضر مصفر وباهت ، أضف أحد المنتجات أدناه إلى تربة البذر : \r\n • النيتروجين : 40 جم / متر مربع على هيئة كبريتات الأمونيوم أو محلول اليوريا بتركيز 0.25 ٪ ( 2.5 جم / لتر ) \r\n• الفوسفور : 50 جم / متر مربع على هيئة سوبر فوسفات \r\n • البوتاسيوم : 30 جم / متر مربع على هيئة كلوريد بوتاسيوم  \r\n• تحدث إلى جيرانك والمستشار الزراعي وممثلي شركة الأسمدة وتجار التجزئة لفهم الجرعات التي تناسب أغراضك .",
            'title' => "خصب حاضنات البذور لبدء انطلاق النباتات بصحة جيدة",
        ]);

        $step12 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 2,
            'interval' => 1,
            'description' =>"ان بذر البذور في قيعان البذور مع التربة المخصبة يتيح لك الحصول إن بذر البذور في قيعان البذور مع التربة المخصبة يتيح على شتلات قوية لزرعها . واحدة من المشاكل التي قد تحدث من تلف الجذر عندما يتم سحب النباتات من التربة هي أن تعاني الشتلات لزرعها . قد يؤخر ذلك النمو أو يتسبب في موت الشتلات . ممارسات الري الجيدة يمكن أن تساعد في منع هذه المشكلة .",
            'title' => "كيفية زراعة البذور في الحضانة",
        ]);

        $step13 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 2,
            'interval' => 2,
            'description' =>"تشير تقوية الشتلات إلى التعريض التدريجي للشتلات المزروعة في قاع البذر إلى بيئة أكثر قسوة . يزيد هذا من مقاومتها وفرص بقائها على قيد الحياة بعد الزرع . يمكن أن تتم التقوية بطرق مختلفة ، وذلك باستخدام الضوء ، ورفع درجات الحرارة ، أو الامتناع عن الري . \r\n• تعريض الشتلات تدريجياً إلى شدة ضوئية أعلى و / أو درجات حرارة أعلى على مدار فترة تتراوح من 7 إلى 10 أيام قبل الزرع . \r\n• خفض كميات الري أو الامتناع عن الري 4-5 أيام قبل الزرع .",
            'title' => "قم بتقوية الشتلات من لزيادة فرص بقائها على قيد الحياة",
        ]);
        $step14 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 2,
            'interval' => 1,
            'description' =>"يحدث الري الأول مباشرة بعد بذر البذور في قاع البذر ، ويجب أن يكون كبيرا لضمان ملامسة تربة البذور بشكل جيد لزيادة فرص الإنبات . بعد ذلك ، يمكنك الري بشكل أكثر سطحية خلال الأيام الثلاثة أو الخمسة القادمة في الصباح والمساء . حيث تساعد التربة الرطبة على تعزيز الإنبات وإنشاء محصول جيد . إذا كنت تروي جيدا ، فستنبت البذور بعد 5 إلى 7 أيام من الزراعة .",
            'title' => "قم بري حاضنات البذور بالماء من أجل انبات البذور بشكل جيد",
        ]);
        $step14 = Step::create([
            'plant_schedule_id' => 3,
            'stage_id' => 2,
            'interval' => 2,
            'description' =>"يتم التخفيف عادة في غضون 2-3 أيام بعد ظهور الورقة الحقيقية الأولى ، أو بعد حوالي 5-7 أيام من البذر . إليك بعض التوصيات : \r\n•قم بإزالة المهاد الذي وضعته على قاع البذور بعد البذر . \r\n• اسحب الشتلات الضعيفة أو المريضة من التربة . \r\n• تأكد من أن الشتلات المتبقية تتباعد حوالي 5 سم داخل الصف . \r\n• ازرع الشتلات التي قمت بإزالتها في حاويات من التربة . وبعدها يمكن استخدامها لسد الفجوة في الحقل في وقت لاحق من الموسم .\r\n• هذا مهم بشكل خاص عند استخدام بذور باهظة الثمن",
            'title' => "تخفيف الشتلات لتنمو النباتات بشكل صحي"
        ]);

        $step15 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 3,
            'interval' => 1,
            'description' =>"ستساعد التربة الرطبة على تعزيز تشكيل الجذور وتعزيز نشأة جيدة للشتلات . فيما يلي بعض التوصيات حول كيفية الشتلات في قيعان البذر : \r\n• الري بشكل كبير لتأمين نشأة جيدة للشتلات . \r\n• الري في الصباح حتى يتسنى للمحاصيل الوصول مباشرة إلى المياه ، والتي يمكن أن تجف خلال النهار . \r\n• قم بالتخطيط للري بعد 10 و 15 و 25 يوماً من البذر لتقوية النباتات . \r\n• إذا اخترت تقوية الشتلات عن طريق تقليل الماء ، فتوقف عن الري في هذه المرحلة . حيث تساعد تقوية الشتلات الخاصة بك على تعودها على الظروف الجوية القاسية الموجودة في الحقول المفتوحة . \r\n• تأكد من الري مرة أخرى في اليوم السابق لنقل الشتلات لتنعيم التربة حول الجذور .",
            'title' => "قم بالري بانتظام من اجل تأمين نشأة جيدة للشتلات"
        ]);

        $step16 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 3,
            'interval' => 1,
            'description' =>"فيما يلي بعض التوصيات حول موعد زراعة شتلات الخضروات لتأمين نشأة جيدة للمحصول في الحقل : \r\n• في المناخات الباردة أو في حال الزراعة على ارتفاعات عالية ، لا تتم عملية الزرع إلا بعد الصقيع الأخير في الربيع لتجنب الخسائر . \r\n• يجب أن تكون درجات الحرارة ليلاً ونهاراً فوق 12 درجة مئوية لعدة أيام . • يجب أن تكون الشتلات ذات عمر ونمو مناسبين . فالشتلات القديمة جدا قد لا تنمو جيدا . \r\n• ازرع في ساعات المساء أو في يوم غائم لتقليل الصدمة الأسموزية للجذور والنبتة من العوامل الخارجية . \r\n• ازرع في أخاديد صغيرة مسطحة أو ضحلة ، وهذا يتوقف على حسب توافر الري .",
            'title' => "الوقت المناسب لزرع الشتلات في حقلك"
        ]);
        $step17 = Step::create([
            'plant_schedule_id' => 7,
            'stage_id' => 3,
            'interval' => 1,
            'description' =>"يمكن أن يساعد استخدام مبيدات الأعشاب قبل ظهورها في منع انتشار الحشائش والسيطرة عليها في حقولك عند استخدامها بشكل صحيح . تشتمل إزالة الأعشاب الضارة على مكافحة ظهور الأعشاب الضارة قبل تواحدها لتجنب نموها . إليك بعض التوصيات : \r\n•مبيدات الأعشاب قبل ظهورها تستخدم عادة لتجنب إنبات الحشائش السنوية . \r\n• بعد يومين إلى ثلاثة أيام من الزرع ، يمكن استخدام مبيدات الأعشاب المعتمدة على الفلوكلورالين بمعدل 800 مل لكل فدان ، مخففة في 200 لتر من الماء . \r\n• قم دائماً بقراءة الملصق بعناية ، واتخاذ الاحتياطات اللازمة عند استخدام المنتج . \r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن مبيدات الأعشاب قبل ظهورها التي تناسب أغراضك .",
            'title' => "حطط جيدا لمكافحة الاعشاب قبل ظهورها"
        ]);

        $step18 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 3,
            'interval' => 2,
            'description' =>"فيما يلي بعض التوصيات الإضافية حول موعد وكيفية زراعة شتلات الطماطم :\r\n• المسافة الموصى بها للأنواع غير المحددة ( الأصناف ذات النمو المحدد ) هي 75-90 سم × 30-45 سم \r\n• المسافة الموصى بها للأنواع غير المحددة ( الأصناف دون حد نمو محدد مسبقا ) هي 90-120 سم × 30-45 سم .\r\n•قم بري الأخاديد بغزارة قبل 3-4 أيام من الزرع . \r\n • اسحب الشتلات من تربة البذر بعناية ، واجمعها في وعاء . \r\n• تأكد من أن النباتات الصغيرة لديها ما يكفي من التربة حول الجذور للبدء في تطوير الجذور . \r\n• إذا لزم الأمر ، قم بإزالة بعض الفروع السفلية من الشتلات لتنظيف المظلة الخضرية . \r\n• قم بزراعة الشتلات بعمق كاف تحت التربة ، بحيث لا يتبقى فوق سطح التربة سوى الأوراق . \r\n• اضغط على التربة بقوة وحزم حول الجذور للقضاء على جيوب الهواء . \r\n• تذكر أن لديك أيضا خياراً استخدام آلة زرع الشتلات . \r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن المسافة التي تناسب أغراضك ، في حالة الشك .",
            'title' => "كيفية زراعة شتلات الطماطم"
        ]);
        $step19 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 3,
            'interval' => 2,
            'description' =>"يعتبر الري بعد الزرع مهما لربط الشتلات بالتربة وتقليل الصدمة للجذور . فيما يلي بعض التوصيات الأخرى حول كيفية خلال الأسابيع الأولى في الحقل :\r\n• قم بري  الشتلات بالماء قبل الزرع لتنعيم التربة حول الجذور . \r\n• قم بالري مرة أخرى بعد الزرع مباشرة لربط التربة حول النبات الصدمة الاسموزية . والحد من \r\n• يجب التخطيط للري مرتين بعد 5 و 10 أيام من الزرع . \r\n• خلال فصل الصيف ، لا تنس الري لمرات أكثر ( 5-6 أيام ) ، أو على حسب الرطوبة . \r\n• تجنب الإفراط في الري . فالرطوبة الزائدة قد تعزز انتشار الأمراض الفطرية وتسبب الإجهاد .",
            'title' => "قم بري الشتلات بالماء بسخاء قبل وبعد الزرع"
        ]);
        $step20 = Step::create([
            'plant_schedule_id' => 2,
            'stage_id' => 3,
            'interval' => 3,
            'description' =>"• نفذ عملية ملء الفجوات في غضون 10 أيام من أول عملية زرع .\r\n• قم بذلك خلال ساعات المساء أو في الأيام الملبدة بالغيوم لتقليل الصدمة إلى النباتات . \r\n• استخدم الشتلات التي احتفظت بها بعد تقليم الشتلات في الحضانة . وستكون الشتلات الإضافية مفيدة جداً في حال الحاجة إليها . \r\n• لا تنس أن تروي النباتات المزروعة حديثا .",
            'title' => "استخدام الشتلات الاضافية لسد الفجوات في الحقل"
        ]);
        $step21 = Step::create([
            'plant_schedule_id' => 7,
            'stage_id' => 3,
            'interval' => 3,
            'description' =>"تستخدم مبيدات الأعشاب بعد ظهورها ضد الحشائش التي نمت بالفعل في الحقل . حيث يتم رشها على النبات ، وتكون أقل فاعلية إذا تم غسلها من سطح الورقة بسبب الأمطار أو الري . فيما يلي بعض التوصيات حول كيفية استخدامها : \r\n• هناك أساساً نوعان من مبيدات الأعشاب بعد ظهورها : مبيدات ملامسة ، ومبيدات جهازية . \r\n• تؤثر مبيدات الأعشاب الملامسة على أجزاء النبات التي تم رشها فقط ، أي يجب أن يكون الرش على الحشائش شاملاً . \r\n• مبيدات الأعشاب الجهازية تؤثر على النبات بأكملها وتكون فعالة بشكل خاص ضد الأعشاب الضارة أو النباتات التي تنمو من الأجزاء النباتية الموجودة تحت الأرض . \r\n• يمكن أيضا تصنيف مبيدات الأعشاب بعد ظهورها على أنها انتقائية ( تعمل ضد محصول معين ) أو غير انتقائية ( لمكافحة الأعشاب الضارة على نطاق واسع ) . \r\n• الميتربيوزين ( 0.11 -0.2 كجم لكل فدان ) ، يمكن تطبيقه عندما يحتوي المحصول على 4-6 أوراق لمكافحة بعض الحشائش عريضة الأوراق وأنواع الحشائش العشبية\r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن مبيدات الأعشاب -بعد ظهورها- الأكثر ملاءمة لأغراضك .",
            'title' => "حطط لتعشيب جيد عن طريق استخدام مبيدات الاعشاب بعد نموها"
        ]);

        $step22 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 3,
            'interval' => 4,
            'description' =>"تنمو النباتات في هذه المرحلة بسرعة كبيرة ، وتحتاج إلى المزيد من الطعام على هيئة مغذيات لدعم هذا النمو . الآن ، وقد تم استهلاك الأسمدة المضافة إلى التربة قبل الزراعة . إذا كنت تستخدم الري بالغمر ، فيوصى بنثر المغذيات على جانبي التلال : \r\n• ضع كريات الأسمدة على الأخاديد ، واخلطها في التربة فيما يسمى بالنثر الجانبي . \r\n• في هذه المرحلة ، تتم إضافة ربع إجمالي الاحتياجات من النيتروجين ، والتي تصل إلى 20 كجم من اليوريا لكل فدان . \r\n• إذا لم تكن هناك أمطار متوقعة ، فلا تنس أن تروي المحصول حتى تتمكن العناصر الغذائية من الوصول إلى جذور النباتات . \r\n• في حالة استخدام الري بالتنقيط ، يمكن خلط الأسمدة بماء الري بالجرعات الموصى بها . \r\n• اسأل مسئول الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك .",
            'title' => " قم باضافة التطبيق الانقسامي(المجزأ)الأول من الأسمدة المعدنية "
        ]);

        $step23 = Step::create([
            'plant_schedule_id' => 8,
            'stage_id' => 3,
            'interval' => 4,
            'description' =>"يعتبر الري في الوقت المناسب ضروريا للنمو الخضري الجيد ونمو الزهور ومجموعات الفاكهة وتطور الفاكهة . وبالتالي ، يمكن الحصول على إنتاجية أعلى عند مستوى الرطوبة الأمثل وظروف خصوبة التربة . ستعتمد متطلبات المياه بالطبع على هطول الأمطار ، وكذلك أيضا على نوع التربة والموسم . اتبع التوصيات الواردة أدناه لنباتات صحية وإنتاجية عالية : \r\n• خلال الطقس الحار والجاف ، يجب الري كل 4-5 أيام . • خلال الطقس البارد الرطب ، يمكنك الري على فترات قد تصل إلى مرة كل 7-12 يوما . \r\n• لا تنس أن التربة الرملية تتطلب ريا أكثر تكرارا من التربة الطينية . \r\n• تجنب الري كثيرا بعد فترة طويلة من الجفاف ؛ فهذا قد يسبب تشوه الفاكهة . \r\n• لا تفرط في الري ، لأن محاصيل الخضر عادة ما تكون حساسة للغاية للري الزائد وتنقيع الماء .",
            'title' => "حان الوقت لتروي محاصيلك لتحقيق نمو قوي"
        ]);

        $step24 = Step::create([
            'plant_schedule_id' => 3,
            'stage_id' => 3,
            'interval' => 5,
            'description' =>" سترفع العصي المغروسة بشكل عمودي النباتات عن الأرض ، وتسمح بدوران الهواء في المظلة الخضرية . قبل القيام بأي شيء  ، تأكد أن النباتات الخاصة بك من النوع غير المنتشر ، أي أنها تنمو بشكل مستقيم نحو الأعلى . يمكن القيام بعملية توقيف العصي في أي وقت بعد الزرع ، وبعد شهر على الأقل . فيما يلي بعض التوصيات حول كيفية وتوقيت استخدام العصي في حقولك : \r\n•يمكنك استخدام العصي الخشبية أو البلاستيكية أو الخيزرانية ، والتي يمكنك إعادة استخدامها في المواسم التالية . \r\n• يجب أن تكون العصي على ارتفاع حوالي 200 سم ، وغرسها على عمق حوالي 30 سم في الأرض قبل أن يطور النبات جذوره \r\n• مع نمو النبات ، اربط الجذع بالعصى بالحبال الزراعية أو الأقواس دون إتلاف النبات . \r\n• سيحول هذا الوقاية من الأمراض . دون تكسير الفروع والتلامس مع التربة ، وبالتالي \r\n• كوم التربة حول قاعدة السيقان تدريجياً لتعطي السيقان دعماً إضافيا ًعند حمل الثمار  .",
            'title' => "استخدم طريقة دعم النبات للمحافظة عللى صحة النبات وقدرتة على حمل الفاكهة"
        ]);
        $step25 = Step::create([
            'plant_schedule_id' => 3,
            'stage_id' => 3,
            'interval' => 6,
            'description' =>"تتكون تربية نباتات الطماطم من إزالة النمو النباتي غير المرغوب به من أجل تقليل كثافة المظلة الخضرية ، وزيادة مقدار تعرض النبات للضوء ، وبالتالي تحسين احتمال نمو الثمار . كما يجب قطع الأوراق الموجودة عند قاعدة النباتات وحتى ارتفاع يتراوح بين 30-60 سم لتجنب انتقال الأمراض من التربة . مما يؤدي إلى زيادة العائد المبكر والجودة الكاملة من خلال القيام بذلك . كما أن تقليم الفروع والأوراق المريضة والتالفة من النبات يحسن أيضا من الصحة العامة للنبتة .",
            'title' => "ازالة النمو النباتي الغير مرغوب به لنمو فواكة جيدة"
        ]);

        $step26 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 4,
            'interval' => 1,
            'description' =>"إن نباتات الطماطم في حقلك هي الآن في مرحلة إنتاج الفاكهة . وهذا يعني أن النباتات تتطلب كميات كبيرة من النيتروجين والمغذيات الدقيقة لتطوير الفواكه بشكل صحيح . إذا كنت تستخدم الري بالغمر ، فإن أفضل طريقة لتخصيب نباتاتك هي عن طريق الرش الجانبي للمغذيات : \r\n• ضع كريات الأسمدة في الأخاديد ، واخلطها في التربة . \r\n• يضاف الربع الأخير من النيتروجين في هذه المرحلة إلى النباتات ، والتي تبلغ 20 كجم من اليوريا لكل فدان . \r\n• في حالة عدم توقع هطول أمطار ، لا تنس الري حتى تتمكن العناصر الغذائية من الوصول إلى الجذور . \r\n• في حالة استخدام الري بالتنقيط ، يمكن خلط الأسمدة بمياه الري . \r\n• اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن مزيج المغذيات الأنسب لأغراضك .",
            'title' => "التطبيق الانقسامي الثاني للأسمدة"
        ]);
        $step27 = Step::create([
            'plant_schedule_id' => 10,
            'stage_id' => 4,
            'interval' => 1,
            'description' =>"فكر في تكميل التطبيق الانقسامي الثاني للنيتروجين بالمغذيات الدقيقة مثل البورون والزنك والمنغنيز والحديد والكالسيوم لتحقيق نمو متوازن وتطوير جيد للفاكهة . إليك بعض التوصيات الأخرى : \r\n• خطط للرش الورقي لمحلول يحتوي على البورون ، مع البوراكس ( 4 جم / لتر ) على سبيل المثال . \r\n• في التربة التي تعاني من نقص الزنك ، تأكد من إضافة الزنك ، على سبيل المثال على هيئة كبريتات الزنك ( 5 جم / لتر ) . \r\n• إذا لم تكن متأكدا ، فاختبر تربتك أو نباتاتك لمعرفة محتوى المغذيات الدقيقة قبل اختيار المنتج . \r\n• اسأل ضابط الإرشاد الزراعي أو بائع التجزئة المحلي عن المزيج المغذي الأنسب لأغراضك .",
            'title' => "أضف المغذيات الدقيقة الى نباتاتك لنمو فاكهة جيدة"
        ]);
        $step28 = Step::create([
            'plant_schedule_id' => 5,
            'stage_id' => 4,
            'interval' => 2,
            'description' =>"قد تؤدي زيارات النحل للمحاصيل خلال فترة الإزهار إلى زيادة الإنتاج النهائي في حقول الخضار بنسبة 10 % على الأقل . وبالتالي ، فقد يكون من المفيد وضعها في الحقل أو حوله في بداية نمو الأزهار ( عادة 1-2 خلية نحل صحية لكل هكتار ) . ومع ذلك ، فإنه في العديد من المناطق ، قد لا يكون من الضروري وضع خلايا النحل داخل الحقل ، لأن نحل العسل يمكن أن يسافر من على بعد أميال ، وينجذب بشكل طبيعي إلى زهور الخضروات . من المهم أيضا التحكم في استخدام المبيدات الحشرية واسعة الطيف للحفاظ على صحة النحل .",
            'title' => "يزيد النحل من تلقيح الزهور وبالتالي الانتاجية"
        ]);

        $step29 = Step::create([
            'plant_schedule_id' => 4,
            'stage_id' => 5,
            'interval' => 1,
            'description' =>"قم بمراقبة نمو محصولك بشكل منتظم ومتكرر . قم بالمشي بين الصفوف الزراعية بطريقة عشوائية أو متعرجة ، وتحقق من - علامات وأعراض الأمراض أو الآفات أو مشاكل النقص . وتظهر أوجه القصور ونقص مقومات الحياة على هيئة تغير يطرأ على لون الأوراق وضعف قوة وحيوية النباتات . أما الأمراض ، فغالبا ما تكون مرئية على هيئة تغير في اللون أو تبقع أو تلون على هيئة خطوط طولية أو عرضية على الأوراق أو السيقان أو الجذور . أخيرا ، تذكر أن معظم الحشرات الموجودة في الحقل مفيدة لمحصولك . أما الضارة منها ، فهي تهاجم محصولك تاركة وراءها على الأوراق والبراعم على هيئة ثقوب . تأكد . التحدث مع جيرانك وتبادل المعلومات حول الأمراض الحالية مع مجتمعك المحلي . ابحث أيضا عن الدعم من موفري من خدمات الإرشاد الزراعي العام في منطقتك .",
            'title' => "راقب الحقل بشكل منتظم ومتكرر"
        ]);

        $step30 = Step::create([
            'plant_schedule_id' => 15,
            'stage_id' => 6,
            'interval' => 1,
            'description' =>"يتم قطف الفواكه عادة على فترات كل 4-5 أيام في الصيف ، وعلى فترات أسبوعية خلال فصل الشتاء . استخدم الصناديق الكبيرة للفواكه التي لا تزال خضراء ، أو قم بتعبئة الفواكه في صناديق واسعة ضحلة وقابلة للتكديس إذا كانت ناضجة بالفعل لتجنب التلف الناجم عن الضغط . يجب أن تحتوي حاويات القطف على جدران داخلية ناعمة لمنع تآكل الثمار الناجم عن الاحتكاك . يجب تظليل الطماطم ( البندورة ) التي يتم حصادها في الحاويات لتقليل الإجهاد والضرر الناتج عن الحرارة . يوصى بعدم ملء الحاويات بأكثر من 10 كجم من الفاكهة . في أي حال ، يجب تنظيف معدات القطف وتعقيمها في نهاية كل يوم حصاد للوقاية من الأمراض .",
            'title' => "اعداد أدوات الحصاد وتنظيفها"
        ]);
        $step31 = Step::create([
            'plant_schedule_id' => 15,
            'stage_id' => 6,
            'interval' => 1,
            'description' =>"الظروف : \r\n• يجب قطف الطماطم خلال أبرد جزء من اليوم ، مثل الصباح الباكر أو بعد العصر . حيث أن الفواكه المعرضة للشمس لعدة ساعات تكون أكثر عرضة للكدمات أثناء عملية القطف . \r\n• لا تدع الفواكه المحصودة في الشمس لفترات طويلة من الزمن . استخدم القطع القماشية لتغطيتها . \r\n• تجنب قطف الفواكه المغطاة بندى الصباح أو مياه الأمطار . وقم بتأخير الحصاد حتى يجف سطح الفاكهة ، حيث يمكن للرطوبة أن تساعد في انتشار التعفن والمرض . \r\nالطريقة : \r\n• من المهم إزالة ثمار الطماطم بعناية من النبات عن طريق لويها بلطف أو تدويرها . \r\n• يجب إزالة الجذع قبل وضع الثمرة في الحاوية ، لأنه قد يتلف حبات الطماطم الأخرى ، خاصة إذا كانت ناضجة . حتى الكدمات \r\n• إن التعامل مع الطماطم بغاية الدقة أمر ضروري ، لأنه الطفيفة قد تشوه الفاكهة . \r\n• يوصى باستخدام القفازات القطنية أثناء الحصاد لتفادي الأضرار التي تلحق بالثمار وكذلك ملامسة الجلد بشكل مباشر . \r\n• لا يمكنك -تحت أي ظرف من الظروف- رمي الفاكهة أو إسقاطها في وعاء القطف .",
            'title' => "الظروف والطرقة المناسبة لحصاد الطماطم"
        ]);

        $step32 = Step::create([
            'plant_schedule_id' => 16,
            'stage_id' => 6,
            'interval' => 2,
            'description' =>"تتضمن ظروف التخزين الجيدة ما يلي : \r\n• الحماية من أشعة الشمس والحشرات والقوارض والطيور . \r\n• التهوية الجيدة . \r\n• الظروف الصحية الجيدة . \r\n• الاستخدام الفعال للمساحة . \r\n• سهولة الحفاظ على المحصول المخزن وإدارته . • سهولة الوصول للتحميل والتفريغ . إرشادات التخزين على المدى القصير ( حتى أسبوع ) :\r\n• تأكد من أن البيئة جيدة التهوية و / أو ظليلة لتقليل تراكم الحرارة . تأكد من من التنفس الحيوي .\r\n• تظل الطماطم المخزنة في درجة حرارة الغرفة في الداخل ( 15-25 درجة مئوية ) أو في مكان مظلل بالخارج صالحة لمدة 4-7 أيام .\r\n• إرشادات للتخزين طويل المدى : \r\n• تبرد الطماطم إلى 13 درجة مئوية بعد الحصاد مباشرة . \r\n• بالنسبة للتخزين طويل الأجل ، من المهم الحفاظ على درجات حرارة تتراوح بين 10-15 درجة مئوية والرطوبة النسبية 85-95 % . \r\n• التهوية الجيدة في غرفة التخزين ضرورية أيضا .",
            'title' => "تخزين الطماطم بشكل صحيح"
        ]);

        $step33 = Step::create([
            'plant_schedule_id' => 6,
            'stage_id' => 7,
            'interval' => 1,
            'description' =>"تأكد من إزالة جميع مخلفات المحاصيل بعد الحصاد لتجنب احتمال إعادة ظهور المرض في نفس الحقل . أما في حالة انتشار الآفات ، فاحرث الأرض مع تقليب التربة لتعريض الحشرات للحيوانات المفترسة والتعقيم بالإشعاع الشمسي ( التشميس ) . فكر في استخدام المحاصيل الغطائية بين الفصول لزيادة محتوى الكربون العضوي ورطوبة التربة . أخيرا ، فكر في ترك الحقل في حالة البور لفترة من الوقت لتعزيز إمكانياته .",
            'title' => "قم باجراء الادارة الحقلية المناسبة بعد الحصاد"
        ]);
        $step34 = Step::create([
            'plant_schedule_id' => 5,
            'stage_id' => 7,
            'interval' => 1,
            'description' =>"الطماطم هي جزء من العائلة الباذنجانية . والتي تشمل البطاطا والفلفل والفليفلة والفلفل الحار والباذنجان والتبغ . لا ينبغي أن تزرع الطماطم ( البندورة ) على التوالي في نفس الحقل ، ويتطلب الحقل أخذ استراحة لمدة سنة واحدة على الأقل بين زراعة الطماطم ( البندورة ) ، أو غيرها من المحاصيل التي تنتمي إلى العائلة الباذنجانية . كما يجب تجنب المحاصيل التي تنتمي إلى عائلة القرعيات ( الخيار ، القرع ، قرع الكوسة والكرنب ، والبطيخ ) . فيما يلي بعض المحاصيل الموصى بزراعتها بعد الطماطم : \r\n• البقوليات ( الفول ، البازلاء ، إلخ ) \r\n• الحبوب ( الأرز والسورغم والقمح والدخن وغيرها ) \r\n• المحاصيل الكرنبية ( الكرنب ، القرنبيط ، الكرنب الساقي ( اللفت الألماني ) ، إلخ ) \r\n• زهور الزينة ( مثل القطيفة )",
            'title' => "فكر في دورة المحاصيل القادمة"
        ]);


    }
}
